
#      Самостоятельная работа по уроку "Распаковка параметров и параметры функции"

# 1.
def print_params( a = 1, b ="строка", c = True):
    print(a, b, c)

print_params()
print_params(b = 25)
print_params(c= [1, 2, 3])

# РЕЗУЛЬТАТ:
# 1 строка True
# 1 25 True
# 1 строка [1, 2, 3]
#===========================================


# 2.

values_list = [True, 33, 'зебра']
values_dict = {'a': False, 'b': 3.14, 'c': 100 }

print_params(*values_list)
print_params(**values_dict)

# РЕЗУЛЬТАТ:
# True 33 зебра
# False 3.14 100

#===========================================


# 3.

values_list_2 = [True, 33]
print_params(*values_list_2, 42)

# РЕЗУЛЬТАТ:
# True 33 42
#====================================================================


# ВЕСЬ ИТОГОВЫЙ РЕЗУЛЬТАТ РАБОТЫ КОДА СО ВСЕМИ ЗАДАНИЯМИ ОДНОВРЕМЕННО:

# 1 строка True
# 1 25 True
# 1 строка [1, 2, 3]
# True 33 зебра
# False 3.14 100
# True 33 42
