#  Практическая работа по уроку
# "Организация программ и методы строк."


my_string = input("Введите первую строку стихотворения: ")
print (len(my_string))                         # длина строки
print ((my_string).upper())                    # строка в верхнем регистре
print ((my_string).lower())                    # строка в нижнем регистре
print (my_string.replace(" ",""))  # строка без пробелов
print (my_string[0])                           # первый символ строки
print (my_string[-1])                          # последний символ строки